w7/pokedex_Day1/app/controllers/toys_controller.rb

SELECT  "toys".* FROM "toys"  WHERE "toys"."id" = $1 LIMIT 1  [["id", 1]]
---
  def update
    @toy = Toy.find(params[:id])